/**
 * @Author: ZhaoYadong
 * @Date: 2023-11-18 18:37:38
 * @LastEditors: ZhaoYadong
 * @LastEditTime: 2023-11-18 18:51:21
 * @FilePath: /src/fisco-bcos-sdk/client/group_status_code.go
 */
package client

var GroupCodeMessage = map[string]string{
	"0x0": "接口调用成功",
	"0x1": "节点内部错误",
	"0x2": "调用创建群组接口时，群组已存在",
	"0x3": "调用启动群组接口时，群组已处于运行状态",
	"0x4": "调用停止群组接口时，群组已处于停止状态",
	"0x5": "调用删除群组接口时，群组已处于删除状态",
	"0x6": "调用接口时，对应的群组不存在",
	"0x7": "调用接口时，参数不合法",
	"0x8": "调用创建群组接口时，与sealer间不存在有效的P2P连接",
	"0x9": "调用创建群组接口时，创世块配置文件已存在",
	"0xa": "调用创建群组接口时，群组配置文件已存在",
	"0xb": "调用启动群组接口时，未找到创世块配置文件",
	"0xc": "调用启动群组接口时，未找到群组配置文件",
	"0xd": "调用接口时，群组正在释放资源",
	"0xf": "调用恢复接口时，群组并未被删除",
}
